Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM3204JH00032.svd
            <register>
               <name>OSC48MDIV</name>
               <description>OSC48M Divider</description>
               <addressOffset>0x15</addressOffset>
               <size>8</size>
               <resetValue>0x0B</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>OSC48M Division Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>48 MHz</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>24 MHz</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>16 MHz</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>12 MHz</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV5</name>
                           <description>9.6 MHz</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV6</name>
                           <description>8 MHz</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV7</name>
                           <description>6.86 MHz</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>6 MHz</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV9</name>
                           <description>5.33 MHz</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV10</name>
                           <description>4.8 MHz</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV11</name>
                           <description>4.36 MHz</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV12</name>
                           <description>4 MHz</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV13</name>
                           <description>3.69 MHz</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV14</name>
                           <description>3.43 MHz</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV15</name>
                           <description>3.2 MHz</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>3 MHz</description>
                           <value>15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSC48MSTUP</name>
               <description>OSC48M Startup Time</description>
               <addressOffset>0x16</addressOffset>
               <size>8</size>
               <resetValue>0x07</resetValue>
               <fields>
                  <field>
                     <name>STARTUP</name>
                     <description>Startup Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>CYCLE8</name>
                           <description>166 ns</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16</name>
                           <description>333 ns</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32</name>
                           <description>667 ns</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE64</name>
                           <description>1.333 us</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE128</name>
                           <description>2.667 us</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE256</name>
                           <description>5.333 us</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE512</name>
                           <description>10.667 us</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE1024</name>
                           <description>21.333 us</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSC48MSYNCBUSY</name>
               <description>OSC48M Synchronization Busy</description>
               <addressOffset>0x18</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OSC48MDIV</name>
                     <description>OSC48MDIV Synchronization Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLCTRLA</name>
               <description>DPLL Control</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLRATIO</name>
               <description>DPLL Ratio Control</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>LDR</name>
                     <description>Loop Divider Ratio</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>LDRFRAC</name>
                     <description>Loop Divider Ratio Fractional Part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLCTRLB</name>
               <description>Digital Core Configuration</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>FILTER</name>
                     <description>Proportional Integral Filter Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FILTERSelect</name>
                        <enumeratedValue>
                           <name>DEFAULT</name>
                           <description>Default filter mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LBFILT</name>
                           <description>Low bandwidth filter</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HBFILT</name>
                           <description>High bandwidth filter</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HDFILT</name>
                           <description>High damping filter</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPEN</name>
                     <description>Low-Power Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUF</name>
                     <description>Wake Up Fast</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFCLK</name>
                     <description>Reference Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>REFCLKSelect</name>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>XOSC32K clock reference</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC</name>
                           <description>XOSC clock reference</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK</name>
                           <description>GCLK clock reference</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LTIME</name>
                     <description>Lock Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LTIMESelect</name>
                        <enumeratedValue>
                           <name>DEFAULT</name>
                           <description>No time-out. Automatic lock.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MS</name>
                           <description>Time-out if no lock within 8ms</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>9MS</name>
                           <description>Time-out if no lock within 9ms</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10MS</name>
                           <description>Time-out if no lock within 10ms</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11MS</name>
                           <description>Time-out if no lock within 11ms</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LBYPASS</name>
                     <description>Lock Bypass</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Clock Divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLPRESC</name>
               <description>DPLL Prescaler</description>
               <addressOffset>0x28</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRESC</name>
                     <description>Output Clock Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PRESCSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>DPLL output is divided by 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>DPLL output is divided by 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>DPLL output is divided by 4</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLSYNCBUSY</name>
               <description>DPLL Synchronization Busy</description>
               <addressOffset>0x2C</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>DPLL Enable Synchronization Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLRATIO</name>
                     <description>DPLL Ratio Synchronization Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLPRESC</name>
                     <description>DPLL Prescaler Synchronization Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLSTATUS</name>
               <description>DPLL Status</description>
               <addressOffset>0x30</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>DPLL Lock Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKRDY</name>
                     <description>DPLL Clock Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAL48M</name>
               <description>48MHz Oscillator Calibration</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>FCAL</name>
                     <description>Frequency Calibration (48MHz)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>FRANGE</name>
                     <description>Frequency Range (48MHz)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TCAL</name>
                     <description>Temperature Calibration (48MHz)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
